{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|endoftext|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|im_start|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|im_end|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": null,
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|endoftext|>": 0,
      "<|im_start|>": 1,
      "<|im_end|>": 2,
      "!": 3,
      "\"": 4,
      "#": 5,
      "$": 6,
      "%": 7,
      "&": 8,
      "'": 9,
      "(": 10,
      ")": 11,
      "*": 12,
      "+": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "<": 30,
      "=": 31,
      ">": 32,
      "?": 33,
      "@": 34,
      "A": 35,
      "B": 36,
      "C": 37,
      "D": 38,
      "E": 39,
      "F": 40,
      "G": 41,
      "H": 42,
      "I": 43,
      "J": 44,
      "K": 45,
      "L": 46,
      "M": 47,
      "N": 48,
      "O": 49,
      "P": 50,
      "Q": 51,
      "R": 52,
      "S": 53,
      "T": 54,
      "U": 55,
      "V": 56,
      "W": 57,
      "X": 58,
      "Y": 59,
      "Z": 60,
      "[": 61,
      "\\": 62,
      "]": 63,
      "^": 64,
      "_": 65,
      "`": 66,
      "a": 67,
      "b": 68,
      "c": 69,
      "d": 70,
      "e": 71,
      "f": 72,
      "g": 73,
      "h": 74,
      "i": 75,
      "j": 76,
      "k": 77,
      "l": 78,
      "m": 79,
      "n": 80,
      "o": 81,
      "p": 82,
      "q": 83,
      "r": 84,
      "s": 85,
      "t": 86,
      "u": 87,
      "v": 88,
      "w": 89,
      "x": 90,
      "y": 91,
      "z": 92,
      "{": 93,
      "|": 94,
      "}": 95,
      "~": 96,
      "ВЎ": 97,
      "Вў": 98,
      "ВЈ": 99,
      "ВӨ": 100,
      "ВҘ": 101,
      "ВҰ": 102,
      "В§": 103,
      "ВЁ": 104,
      "В©": 105,
      "ВӘ": 106,
      "В«": 107,
      "В¬": 108,
      "В®": 109,
      "ВҜ": 110,
      "В°": 111,
      "Вұ": 112,
      "ВІ": 113,
      "Ві": 114,
      "Вҙ": 115,
      "Вө": 116,
      "В¶": 117,
      "В·": 118,
      "Вё": 119,
      "В№": 120,
      "Вә": 121,
      "В»": 122,
      "Вј": 123,
      "ВҪ": 124,
      "Вҫ": 125,
      "Вҝ": 126,
      "ГҖ": 127,
      "ГҒ": 128,
      "ГӮ": 129,
      "Гғ": 130,
      "Г„": 131,
      "Г…": 132,
      "ГҶ": 133,
      "ГҮ": 134,
      "ГҲ": 135,
      "Гү": 136,
      "ГҠ": 137,
      "ГӢ": 138,
      "ГҢ": 139,
      "ГҚ": 140,
      "ГҺ": 141,
      "ГҸ": 142,
      "Гҗ": 143,
      "Г‘": 144,
      "Г’": 145,
      "Г“": 146,
      "Г”": 147,
      "Г•": 148,
      "Г–": 149,
      "Г—": 150,
      "Гҳ": 151,
      "Гҷ": 152,
      "Гҡ": 153,
      "Гӣ": 154,
      "Гң": 155,
      "Гқ": 156,
      "Гһ": 157,
      "Гҹ": 158,
      "Г ": 159,
      "ГЎ": 160,
      "Гў": 161,
      "ГЈ": 162,
      "ГӨ": 163,
      "ГҘ": 164,
      "ГҰ": 165,
      "Г§": 166,
      "ГЁ": 167,
      "Г©": 168,
      "ГӘ": 169,
      "Г«": 170,
      "Г¬": 171,
      "Гӯ": 172,
      "Г®": 173,
      "ГҜ": 174,
      "Г°": 175,
      "Гұ": 176,
      "ГІ": 177,
      "Гі": 178,
      "Гҙ": 179,
      "Гө": 180,
      "Г¶": 181,
      "Г·": 182,
      "Гё": 183,
      "Г№": 184,
      "Гә": 185,
      "Г»": 186,
      "Гј": 187,
      "ГҪ": 188,
      "Гҫ": 189,
      "Гҝ": 190,
      "ДҖ": 191,
      "ДҒ": 192,
      "ДӮ": 193,
      "Дғ": 194,
      "Д„": 195,
      "Д…": 196,
      "ДҶ": 197,
      "ДҮ": 198,
      "ДҲ": 199,
      "Дү": 200,
      "ДҠ": 201,
      "ДӢ": 202,
      "ДҢ": 203,
      "ДҚ": 204,
      "ДҺ": 205,
      "ДҸ": 206,
      "Дҗ": 207,
      "Д‘": 208,
      "Д’": 209,
      "Д“": 210,
      "Д”": 211,
      "Д•": 212,
      "Д–": 213,
      "Д—": 214,
      "Дҳ": 215,
      "Дҷ": 216,
      "Дҡ": 217,
      "Дӣ": 218,
      "Дң": 219,
      "Дқ": 220,
      "Дһ": 221,
      "Дҹ": 222,
      "Д ": 223,
      "ДЎ": 224,
      "Дў": 225,
      "ДЈ": 226,
      "ДӨ": 227,
      "ДҘ": 228,
      "ДҰ": 229,
      "Д§": 230,
      "ДЁ": 231,
      "Д©": 232,
      "ДӘ": 233,
      "Д«": 234,
      "Д¬": 235,
      "Дӯ": 236,
      "Д®": 237,
      "ДҜ": 238,
      "Д°": 239,
      "Дұ": 240,
      "ДІ": 241,
      "Ді": 242,
      "Дҙ": 243,
      "Дө": 244,
      "Д¶": 245,
      "Д·": 246,
      "Дё": 247,
      "Д№": 248,
      "Дә": 249,
      "Д»": 250,
      "Дј": 251,
      "ДҪ": 252,
      "Дҫ": 253,
      "Дҝ": 254,
      "ЕҖ": 255,
      "ЕҒ": 256,
      "ЕӮ": 257,
      "Еғ": 258,
      "ex": 259,
      "tex": 260,
      "text": 261
    },
    "merges": [
      [
        "e",
        "x"
      ],
      [
        "t",
        "ex"
      ],
      [
        "tex",
        "t"
      ]
    ]
  }
}